[X2DownloadableContentInfo_AddedPartNames]

;---------------------------
; Mrk's Haloooooooaooooaoo
;---------------------------

;---------------------------
;Torso

;Torso template
.TorsoTemplate="H5_Recruit_K_M"
.TorsoName="2代 新兵"

.TorsoTemplate="H5_Recruit_K_F"
.TorsoName="2代 新兵"

;---------------------------

.TorsoTemplate="H5_MkVICQB_K_M"
.TorsoName="2代 CQB [1代]"

.TorsoTemplate="H5_MkVICQB_K_F"
.TorsoName="2代 CQB [1代]"

.TorsoTemplate="H4_EOD_K_M"
.TorsoName="2代 EOD"

.TorsoTemplate="H4_EOD_K_F"
.TorsoName="2代 EOD"

;---------------------------
;Legs

;Legs template
.LegsTemplate="H5_RecruitLegs_K_M"
.LegsName="2代 新兵"

.LegsTemplate="H5_RecruitLegs_K_F"
.LegsName="2代 新兵"
;---------------------------

;---------------------------
;Torso
;---------------------------
.TorsoTemplate="H4_ODST_K_M"
.TorsoName="2代 地狱伞兵"

.TorsoTemplate="H4_ODST_K_F"
.TorsoName="2代 地狱伞兵"

.TorsoTemplate="H5_Nightfall_K_M"
.TorsoName="2代 夜袭者"

.TorsoTemplate="H5_Nightfall_K_F"
.TorsoName="2代 夜袭者"

;---------------------------
;Legs
;---------------------------
.LegsTemplate="H4_ODSTLegs_K_M"
.LegsName="2代 地狱伞兵"

.LegsTemplate="H4_ODSTLegs_K_F"
.LegsName="2代 地狱伞兵"

.LegsTemplate="H5_NightfallLegs_K_M"
.LegsName="2代 夜袭者"

.LegsTemplate="H5_NightfallLegs_K_F"
.LegsName="2代 夜袭者"


;---------------------------
;Torso
;---------------------------

.TorsoTemplate="H5_Recruit_K_M"
.TorsoName="2代 新兵"

.TorsoTemplate="H5_Recruit_K_F"
.TorsoName="2代 新兵"

.TorsoTemplate="H4_Vanguard_K_M"
.TorsoName="2代 先锋"

.TorsoTemplate="H4_Vanguard_K_F"
.TorsoName="2代 先锋"

;---------------------------
;Legs
;---------------------------

.LegsTemplate="H5_RecruitLegs_K_M"
.LegsName="2代 新兵"

.LegsTemplate="H5_RecruitLegs_K_F"
.LegsName="2代 新兵"

;1代 地狱伞兵 Helmet
[HR_ODST_M X2BodyPartTemplate]
DisplayName="1代 地狱伞兵 头盔"
[HR_ODST_F X2BodyPartTemplate]
DisplayName="1代 地狱伞兵 头盔"

;H2 ODST Helmet
[HR_ODST_M X2BodyPartTemplate]
DisplayName="地狱伞兵 头盔"
[HR_ODST_F X2BodyPartTemplate]
DisplayName="地狱伞兵 头盔"

;HW2 ODST Helmet
[HR_ODST_M X2BodyPartTemplate]
DisplayName="地狱伞兵 头盔"
[HR_ODST_F X2BodyPartTemplate]
DisplayName="地狱伞兵 头盔"


;---------------------------
;Torso
;---------------------------
.TorsoTemplate="H4_Prefect_K_M"
.TorsoName="2代 军士长"

.TorsoTemplate="H4_Prefect_K_F"
.TorsoName="2代 军士长"

.TorsoTemplate="HO_Hoplite_K_M"
.TorsoName="原型 2代 重装步兵"

.TorsoTemplate="HO_Hoplite_K_F"
.TorsoName="原型 2代 重装步兵"

;---------------------------
;Legs
;---------------------------

.LegsTemplate="H4_PrefectLegs_K_M"
.LegsName="2代 军士长"

.LegsTemplate="H4_PrefectLegs_K_F"
.LegsName="2代 军士长"

.LegsTemplate="HO_HopliteLegs_K_M"
.LegsName="原型 2代 重装步兵"

.LegsTemplate="HO_HopliteLegs_K_F"
.LegsName="原型 2代 重装步兵"
